OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/combustion/buoyantReactingFoam/RAS/smallPoolFire2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver              PCG;
        preconditioner      DIC;
        tolerance           1e-6;
        relTol              0.1;
    };

    rhoFinal
    {
        $rho;
        tolerance           1e-6;
        relTol              0;
    };

    p_rgh
    {
        solver              GAMG;
        tolerance           1e-6;
        relTol              0.05;
        smoother            GaussSeidel;
    };

    p_rghFinal
    {
        $p_rgh;
        tolerance           1e-6;
        relTol              0;
    };

    ph_rgh
    {
        $p_rgh;
    }


    "(U|Yi|k|h|FSDomega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
        nSweeps         1;
    };

    "(U|Yi|k|h|FSDomega)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    };


    "Ii.*"
    {
        solver                  GAMG;
        tolerance               1e-4;
        relTol                  0.1;
        smoother                symGaussSeidel;
        maxIter                 3;
        nPostSweeps             1;
    }

    "G.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-04;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors       2;
    nNonOrthogonalCorrectors 0;

    hydrostaticInitialisation yes;
    nHydrostaticCorrectors 5;
}

relaxationFactors
{
    equations
    {
        "(U|k).*"                   1;
        "(C3H8|O2|H2O|CO2|h).*"     1;
    }
}

// ************************************************************************* //
